/* eslint-disable max-len */
const tips = [
    'توی این بازی دو نقش "شهروند" و "جاسوس" وجود دارند که هر کدوم با توجه به هدفی که دارن در نهایت بازی رو میبرند',
    "هر دست از بازی یه مکان به شهروندها گفته میشه",
    "شهروندها برای برنده شدن باید سعی کنن جاسوس یا جاسوس های بازی رو پیدا کنن و در عین حال حواسشون باشه مکانی که بهشون گفته شده رو لو ندن جاسوس هم برای برنده شدن باید سعی کنه نقش خودش رو مخفی نگه داره و مکانی که به شهروندها گفته شده رو حدس بزنه",
    "توی این بازی هیچکس از نقش دیگری خبر نداره حتی جاسوس ها",
];

const asd = [
    "۱) توزیع نقش: گوشی بین بازیکنا می چرخه و به هر کس نقشش گفته میشه اگه شهروند باشی علاوه بر نقشت، مکان هم گفته میشه",
    "۲) شروع بازی: بخش اصلی بازی این مرحلهست، هر بازیکن نقش خودش رو فهمیده و",
    "باید با توجه به هدفی که داره بازی رو ببره این مرحله تایمر بازی شروع میشه، شهروندها باید با بحث کردن، سوال پرسیدن یا شک",
    "انداختن بین همدیگه جاسوس رو پیدا کنن و جاسوس هم باید سعی کنه لو نره، خودش رو از اتهام دور نگه داره و از صحبت ها، مکانی که به شهروندها گفته شده رو بفهمه",
    "در کل همه سعی میکنن تا نقش همدیگه رو بفهمن، بحث کردن راجع به مکان هم میتونه به لو رفتن نقش ها کمک کنه همه چیز به حرفه ای بازی کردن شما برمیگرده",
    "۳) رای گیری: بعد از تموم شده تایمر بازی رای گیری شروع میشه و هر کس با توجه به صحبت هایی که مرحله قبل شد و شکی که به افراد داره میتونه به یک یا چند نفر به عنوان",
    "جاسوس رای بده، خود جاسوس ها هم میتونن توی رای گیری شرکت کنند",
    "۴) نتیجه: هر کس که بیشترین رای رو آورده باشه بازندهست، اگر اون فرد جاسوس باشه، شهروندها برنده می شن و اگر اون فرد شهروند باشه جاسوس برنده میشه",
    "۵) فرصت دوباره به جاسوس: اگر شهروند بیشترین رای رو بیاره و جاسوس برنده بشه بازی تموم میشه اما اگر جاسوس بیشترین رای رو بیاره، بهش یه فرصت دوباره داده میشه",
    "اگر بتونه مکان بازی رو حدس بزنه بدون توجه به نتیجه رای گیری، جاسوس برنده بازی میشه در غیر این صورت شهروندها برنده میشن و بازی تموم میشه",
];

const score = [
    "۱) اگر جاسوس ها برنده دست شوند:",
    "۱. جاسوسی که مکان را به درستی حدس زده باشد ۳ امتیاز می گیرد",
    "۲. جاسوسی که مکان را به درستی حدس نزده باشد ۲ امتیاز می گیرد",
    "۳. شهروندی که جاسوس را به درستی تشخیص داده باشد ۱ امتیاز می گیرد",
    "۴. شهروندی که جاسوس را به درستی تشخیص نداده باشد هیچ امتیازی نمی گیرد",
    "۲) اگر شهروندان برنده دست شوند:",
    "۱. جاسوس هیچ امتیازی نمی گیرد",
    "۲. شهروندی که جاسوس را به درستی تشخیص داده باشد ۲ امتیاز می گیرد",
    "۳. شهروندی که جاسوس را به درستی تشخیص نداده باشد ۱ امتیاز می گیرد",
];

const Guide = {
    header: "راهنما",
    text: [
        {
            title: "شیوه بازی",
            description: tips.join("\n"),
        },
        {
            title: "روند بازی",
            description: asd.join("\n"),
        },
        {
            title: "روند امتیاز دهی هر دست",
            description: score.join("\n"),
        },
    ],
};
export default Guide;
/*
`افراد در این بازی به دو دسته جاسوس و شهروند تقسیم می شوند.
    برای هر دست بازی یک مکان مشخص می شه که فقط شهروندا از اون خبر دارن.
    هدف شهروند: شهروند باید سعی کنه جاسوس بازی رو پیدا کنه ولی در عین حال مکان بازی رو لو نده.
    هدف جاسوس: جاسوس باید هویت خودش رو مخفی نگه داره و سعی کنه مکان بازی رو حدس بزنه.
    روند بازی:
    1.در ابتدا گوشی باید بین افراد بچرخه تاهرکس نقش خودشو بفهمه. وقتی گوشی دستت میاد یا جاسوسی و یا شهروندی که اگر شهروند باشی مکان مشخص شده رو هم می فهمی. (توجه داشته باش که
    هیچکس نقش دیگری رو نمی دونه!) ی
    2. بعد از اعلام نقش ها تایمر بازی فعال میشه و مهم ترین بخش بازی
     شروع میشه افراد تو این مدت باید سعی کی به اهداف خودشون
    برسن. یعنی شهروندای بازی نباید در ابتدا به کسی اعتماد کنند و باید.
    با شک انداختن روی هم جاسوس رو پیدا کنن. اونا باید از بقیه افراد
    بازی سوالاتی بپرسن تا هویت هر کس رو بفهمن.
    بطور مثال مکان بازی "قطب شماله" و یکی از افراد از یکی دیگه می پرسه "تا حالا رفتی اونجا ؟" و اگه اون شخص سریع نگه ک "نه تا حالا نرفتم" یا بگه "اره رفتم" و یا یکم مکث کنه مشخص میشه که جاسوسه.
    در این حین جاسوسا باید سعی کی هویت خوشونو مخفی نگه دارن و
    ازصحبت های شهروندا مکان بازی رو حدس بزنن.همچنین باید
    سعی کنند شهروندا رو گمراه کنند و توجه شهروندا رو به یکی از
    خودشون جلب کنند.
    3. بعد ازتمام شدن تایمر بازی رای گیری انجام میشه و هرکس به کسی ک بیشترین شک رو داره رای میده (جاسوسا هم می تونن رای بدهند.)
    اگه کسی که بیشترین رای رو آورده جاسوس باشه شهروندا برنده می شن در غیر اینصورت جاسوسا.
    امتیاز ویژه برای جاسوسا: بعد از رای گیری هویت جاسوسا مشخص میشه و گوشی به اونا داده میشه. اگر اونا بتونن مکان بازی رو حدس بزنن بدون توجه به نتیجه رای گبی برنده می شن. پس شهروندا باید حواسشون باشه که مکان بازی لو نره.
    از بازی لذت ببرید. 😉`,

*/

//     امتیاز برای شهروندا:در حین بازی سوالاتی در اختیارتان قرار میگیره که می تونید اگه سوالی به ذهنتون نرسید ازشون استفاده کنید.
