/* eslint-disable max-len */
const Guide = {
    header: "راهنما",
    text: `افراد در این بازی به دو دسته جاسوس و شهروند تقسیم می شوند.
    برای هر دست بازی یک مکان مشخص می شه که فقط شهروندا از اون خبر دارن.
    هدف شهروند: شهروند باید سعی کنه جاسوس بازی رو پیدا کنه ولی در عین حال مکان بازی رو لو نده.
    هدف جاسوس: جاسوس باید هویت خودش رو مخفی نگه داره و سعی کنه مکان بازی رو حدس بزنه.
    روند بازی:
    1.در ابتدا گویش باید بین افراد بچرخه تاهرکس نقش خودشو بفهمه. وقتی گوشی دستت میاد یا جاسوسی و یا شهروندی که اگر شهروند باشی مکان مشخص شده رو هم می فهمی. (توجه داشته باش که
    هیچکس نقش دیگری رو نمی دونه!) ی
    2. بعد از اعلام نقش ها تایمر بازی فعال میشه و مهم ترین بخش بازی
     شروع میشه افراد تو این مدت باید سعی کی به اهداف خودشون
    برسن. یعنی شهروندای بازی نباید در ابتدا به کسی اعتماد کنند و باید.
    با شک انداختن روی هم جاسوس رو پیدا کنن. اونا باید از بقیه افراد
    بازی سوالاتی بپربسن تا هویت هر کس رو بفهمن.
    بطور مثال مکان بازی "قطب شماله" و یکی از افراد از یکی دیگه می پرسه "تا حالا رفتی اونجا ؟" و اگه اون شخص سریع نگه ک "نه تا حالا نرفتم" یا بگه "اره رفتم" و یا یکم مکث کنه مشخص میشه که جاسوسه.
    در این حین جاسوسا باید سعی کی هویت خوشونو مخفی نگه دارن و
    ازصحبت های شهروندا مکان بازی رو حدس بزنن.همچنین باید
    سعی کنند شهروندا رو گمراه کنند و توجه شهروندا رو به یکی از
    خودشون جلب کنند.
    3. بعد ازتمام شدن تایمر بازی رای گبی انجام میشه و هرکس به کسی ک بیشترین شک رو داره رای میده (جاسوسا هم می تونن رای بدهند.)
    اگه کسی که بیشترین رای رو آورده جاسوس باشه شهروندا برنده می شن در غیر اینصورت جاسوسا.
    امتیاز ویژه برای جاسوسا: بعد از رای گیری هویت جاسوسا مشخص میشه و گوشی به اونا داده میشه. اگر اونا بتونن مکان بازی رو حدس بزنن بدون توجه به نتیجه رای گبی برنده می شن. پس شهروندا باید حواسشون باشه که مکان بازی لو نره.
    امتیاز برای شهروندا:در حین بازی سوالاتی در اختیارتان قرار میگیره که می تونید اگه سوالی به ذهنتون نرسید ازشون استفاده کنید.
    از بازی لذت ببرید. 😉`,
};

export default Guide;
